import React, { Component } from 'react';

export default class Copyright extends Component {
    constructor(props) {
        super(props);
        this.state = {

        }
    }

    render() {
        return (
            <div className="about-rightCon">
              <h1 className="about-title">服务条款  Terms of Service</h1>
              <h2>免责条款</h2>
              <p>欢迎使用土巴兔！任何使用土巴兔的用户均应仔细阅读本声明，用户可选择不使用土巴兔，用户使用土巴兔的行为，包括进入土巴兔主页及各层页面将被视为对本声明全部内容的认可。</p>
              <p>土巴兔所有刊登内容，以及所提供的信息资料，目的是为了更好地服务我们的访问者，本网站不保证所有信息、文本、图形、链接及其它 项目的绝对准确性和完整性，故仅供访问者参照使用。</p>
              <p>土巴兔不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不做担保。对于因不可抗力或土巴兔不能控制的原因造成的网络服务中
              断或其他缺陷，土巴兔不承担任何责任，但将尽力减少因此而给用户造成的损失和 影响.土巴兔严格保障用户隐私权，对上网用户的个人信息保密，未经上网用户同意不得向他人泄露，但法律另
              有规定的除外.用户自愿注 册个人信息，用户在注册时提供的所有信息，都是基于自愿，用户有权在任何时候拒绝提供这些信息。注册个人信息的用户同意土巴兔对这些信息进行善意利用。用户
              明确同意其使用土巴兔网络服务所存在的风险将完全由其自己承担。</p>
              <p>任何单位或个人认为通过土巴兔的内容（或通过土巴兔到的第三方内容：例如，口袋资源分享）可能涉嫌侵犯其合法权益，应该及时向土 巴兔书面反馈，并提供身份证明、权属证明及详细侵权
              情况证明，土巴兔在收到上述法律文件后，将会尽快删除被控侵权内容。</p>
              <p>除土巴兔注明之服务条款外，其它因使用土巴兔而引致之任何意外、疏忽、合约毁坏、诽谤、版权或知识产权侵犯及其所造成的各种损失 （包括因下载而感染电脑病毒），土巴兔概不负责，亦不承担任何法律责任。</p>
              <p>任何透过土巴兔网页而链接及得到之资讯、产品及服务，土巴兔概不负责，亦不负任何法律责任。</p>
              <p>土巴兔内所有内容并不反映任何土巴兔之意见及观点。</p>
              <p>土巴兔适用于中华人民共和国法律法规规定的其它有关免责规定。</p>
              <h1 className="about-title">版权声明  Copyright</h1>
              <p>深圳市彬讯科技有限公司（以下简称"彬讯公司"）拥有土巴兔网站（www.Tubatu.com）内所有资料的版权。</p>
              <p>彬讯公司对其发行的或与合作公司共同发行的包括但不限于产品或服务的全部内容及土巴兔网站上的材料拥有版权等知识产权受法律保护。未经本公司书面许可，任何单位及个人不得以任何方式或
              理由对上述产品、服务、信息、材料的任何部分进行使用、复制、修改、抄录、传播或与其它产品捆绑使用、销售。</p>
              <p>凡侵犯本公司版权等知识产权的，本公司必依法追究其法律责任。</p>
              <p>本公司法律事务部受本公司指示，特此郑重法律声明！</p>
              <h1 className="about-title">商标声明  Statement of Use</h1>
              <p>"土巴兔"、"Tubatu"、"土巴兔Tubatu.com"、"Tubatu.com"和土巴兔LOGO商标或标识均为彬讯公司享有的商品及服务商标和商号未经本公司或商标权人书面许可，任何单位及个人不得以任何方式或理
              由对该商标的任何部分进行使用、复制、修改、传播、抄录或与其 它产品捆绑使用销售。</p>
              <p>本公司法律事务部受本公司指示，特此郑重法律声明！</p>
              <p>凡侵犯本公司商标权的，我公司必依法追究其法律责任。</p>
            </div>
        )
    }
}
